{
  "name": "hyphe",
  "authors": ["Mathieu Jacomy", "Benjamin Ooghe-Tabanou"],
  "url": "http://hyphe.medialab.sciences-po.fr/",
  "source": "https://github.com/medialab/hyphe",
  "licence": "LGPL / CECILL C",
  "visual": "https://raw.github.com/medialab/hyphe/master/doc/hyphe-visual.png",
  "description": "Hyphe is a webcrawler made to help scientists create a corpus of web actors and a browsable and exportable network of the hyperlinks between them."
  "old_description": "The Hypertext Corpus Initiative proposes to imagine the methodological and technical integration of Web mining technologies in one coherent chain of tools. Context: The growing use of the web as a social media makes web data more and more promising for social sciences. Many tools exist to mine the web, among which the Navicrawler created by Mathieu Jacomy and the issuecrawler from our partner Digital Method Initiative in Amsterdam. the existing Web archiving initiatives (in France BnF and INA) show also the interest one can have about web data. The two tools we mentioned are already used in the Médialab. The navicrawler allows on one side to build a web corpus step by step while browsing (filtering and qualifying websites to include in the corpus) and then export data to create a map based on link topology. On the other side, the issuecrawler is a great tool to harvest a vast quantity of data automatically by crawling from site to site and filtering automatically sites to be included on the basis of a quantitative analysis. Those two approaches are complementary. Researchers have to control how the corpus is built by assuring themselves the qualitative decision such as qualification but also have to be equiped with powerful tools capable of handle the huge amount of data available on the web. However, there is a lack of integration between those two qualitative and quantitative tools, which tends to slow down the use of web data in social siences research. The technical dependency remains too strong. For the very same reasons, the already existing web corpus such as those ones from web archiving missions remains difficult to use for researchers. Objectives: The goal is to allow both qualitative (selection and qualification) and quantitative (data harvesting, indexing and storage) in one chain of tools designed or and by non-technical users among who are social sciences researchers and librarians.",
  "description_fr": "Dans le cadre du projet Hypertext Corpus Initiative, HCI tools a pour objectif de développer une nouvelle génération d’outils pour la constitution et l’exploration de corpus de sites web. L’objectif de cette initiative est d’améliorer l’intégration des activités qualitatives (création et qualification du corpus) et quantitatives (récolte, indexation, stockage des données) liée à la construction d’un corpus web et d’offrir un logiciel conçu par et pour les utilisateurs non techniciens (notamment les chercheurs en sciences humaines et les documentalistes)."
}
